Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90/atdf/PIC32CZ4010CA90100.atdf
        <module name="PTC" id="03721" name2="afe_ptc_ctrl_u2215_v6" version="6a0">
          <instance name="PTC">
            <register-group name="PTC" name-in-module="PTC" address-space="base" offset="0x46828000"/>
            <signals>
              <signal group="DRV" index="0" function="P" pad="PB17"/>
              <signal group="DRV" index="1" function="P" pad="PB16"/>
              <signal group="DRV" index="2" function="P" pad="PB15"/>
              <signal group="DRV" index="3" function="P" pad="PB14"/>
              <signal group="DRV" index="4" function="P" pad="PB13"/>
              <signal group="DRV" index="5" function="P" pad="PB12"/>
              <signal group="DRV" index="6" function="P" pad="PB11"/>
              <signal group="DRV" index="7" function="P" pad="PB10"/>
              <signal group="DRV" index="8" function="P" pad="PB09"/>
              <signal group="DRV" index="9" function="P" pad="PB08"/>
              <signal group="DRV" index="10" function="P" pad="PB07"/>
              <signal group="DRV" index="11" function="P" pad="PB06"/>
              <signal group="ECI" index="0" function="P" pad="PC02"/>
              <signal group="ECI" index="1" function="P" pad="PC03"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_EOC" value="78" caption="Index of DMA EOC trigger"/>
              <param name="DMAC_ID_SEQ" value="76" caption="Index of DMA SEQ trigger"/>
              <param name="DMAC_ID_WCOMP" value="77" caption="Index of DMA WCOMP trigger"/>
              <param name="GCLK_ID" value="43" caption="Index of Generic Clock"/>
              <param name="LINES_NUM" value="32" caption="Number of PTC lines"/>
              <param name="INSTANCE_ID" value="45" caption="Instance index for PTC"/>
              <param name="MCLK_ID_APB" value="53" caption="Index for PTC APB clock"/>
              <param name="PAC_ID" value="45" caption="Index for PTC registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="RSTC" id="03926" name2="pwr_rpmu_rstc_v1" version="1a0">
          <instance name="RSTC">
            <register-group name="RSTC" name-in-module="RSTC" address-space="base" offset="0x44030000"/>
            <parameters>
              <param name="BACKUP_IMPLEMENTED" value="1"/>
              <param name="CM_DBGRESET_STRETCHED" value="12" caption="Reset stretcher size for Cortex CPU related to DBGRESET."/>
              <param name="CM_HRESET_N_STRETCHED" value="12" caption="Reset stretcher size for Cortex CPU related to HRESETn."/>
              <param name="CM_PORESET_STRETCHED" value="12" caption="Reset stretcher size for Cortex CPU related to PORESET."/>
              <param name="HIB_IMPLEMENTED" value="1"/>
              <param name="VBAT_IMPLEMENTED" value="0" caption="One if VBAT (Battery backup mode) is supported"/>
              <param name="INSTANCE_ID" value="5" caption="Instance index for RSTC"/>
              <param name="MCLK_ID_APB" value="8" caption="Index for RSTC APB clock"/>
              <param name="PAC_ID" value="5" caption="Index for RSTC registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="RTC" id="03608" name2="tmr_rtc_u2250_v3" version="3b0">
          <instance name="RTC">
            <register-group name="RTC" name-in-module="RTC" address-space="base" offset="0x44072000"/>
            <signals>
              <signal group="IN" index="0" function="RTC_IN" pad="PB09"/>
              <signal group="IN" index="1" function="RTC_IN" pad="PB08"/>
              <signal group="IN" index="2" function="RTC_IN" pad="PB10"/>
              <signal group="IN" index="3" function="RTC_IN" pad="PB11"/>
              <signal group="IN" index="4" function="RTC_IN" pad="PB01"/>
              <signal group="OUT" index="0" function="RTC_OUT" pad="PB07"/>
              <signal group="OUT" index="1" function="RTC_OUT" pad="PB00"/>
              <signal group="OUT" index="2" function="RTC_OUT" pad="PB02"/>
              <signal group="OUT" index="3" function="RTC_OUT" pad="PB03"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TIMESTAMP" value="4" caption="DMA RTC timestamp trigger"/>
              <param name="NUM_OF_ALARMS" value="2" caption="Number of Alarms"/>
              <param name="NUM_OF_BKREGS" value="0" caption="Number of Backup Registers"/>
              <param name="NUM_OF_COMP16" value="4" caption="Number of 16-bit Comparators"/>
              <param name="NUM_OF_TAMPERS" value="8" caption="Number of Tamper Inputs"/>
              <param name="INSTANCE_ID" value="12" caption="Instance index for RTC"/>
              <param name="MCLK_ID_APB" value="15" caption="Index for RTC APB clock"/>
              <param name="PAC_ID" value="12" caption="Index for RTC registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="SDMMC" id="03592" name2="emb_sdmmc_v2" version="2a0">
          <instance name="SDMMC0">
            <register-group name="SDMMC0" name-in-module="SDMMC" address-space="base" offset="0x458A0000"/>
            <signals>
              <signal group="SDCD" function="I" pad="PC15" ioset="1"/>
              <signal group="SDCK" function="I" pad="PC08" ioset="1"/>
              <signal group="SDCMD" function="I" pad="PC13" ioset="1"/>
              <signal group="SDDAT" index="0" function="I" pad="PC09" ioset="1"/>
              <signal group="SDDAT" index="1" function="I" pad="PC10" ioset="1"/>
              <signal group="SDDAT" index="2" function="I" pad="PC11" ioset="1"/>
              <signal group="SDDAT" index="3" function="I" pad="PC12" ioset="1"/>
              <signal group="SDWP" function="I" pad="PC14" ioset="1"/>
            </signals>
            <parameters>
              <param name="CARD_DATA_SIZE" value="4"/>
              <param name="CLOCK_MULTIPLIER" value="2" caption="Multiplier between &quot;sd_mult_src_clock&quot; and &quot;sd_src_clock&quot;"/>
              <param name="DDR50_SUPPORT" value="0" caption="SD - UHS DDR50 Support Implemented"/>
              <param name="DIVBY2_FOR_SDSRCCLK" value="1" caption="Div-by-2 Source Clock is Implemented"/>
              <param name="DLL_NB_OF_PHASES" value="16"/>
              <param name="EIGHT_BITS_BUS_WIDTH" value="0" caption="Data Bus Width"/>
              <param name="GCLK_ID" value="58"/>
              <param name="GCLK_ID_SLOW" value="59"/>
              <param name="GLOBAL_INTERRUPT" value="1" caption="Global Interrupt"/>
              <param name="HSDDR_SUPPORT" value="0" caption="e.MMC - HSDDR Support Implemented"/>
              <param name="HS200_SUPPORT" value="0" caption="e.MMC - HS200 Support Implemented"/>
              <param name="MAX_BLOCK_LENGTH" value="512" caption="Maximum Block Length"/>
              <param name="MULTIPLE_SLOTS" value="1" caption="Multiple Slots Support Enabled"/>
              <param name="MULT_SRC_CLK_GATED" value="1" caption="Internal Clock Gater is Implemented"/>
              <param name="PROGRAMMABLE_CLK_GENERATOR" value="1" caption="Programmabe Clock Generator is Implemented"/>
              <param name="RETUNING_TIMER" value="0" caption="Retuning Timer"/>
              <param name="RETUNING_TIMER_MAX_VALUE" value="0" caption="Retuning Timer Counter Max Value"/>
              <param name="SDCD_DEBOUNCE_PERIOD" value="328" caption="Debounce Period Value"/>
              <param name="SDR12_SUPPORT" value="0" caption="SD - UHS SDR12 Support Implemented"/>
              <param name="SDR25_SUPPORT" value="0" caption="SD - UHS SDR25 Support Implemented"/>
              <param name="SDR50_SUPPORT" value="0" caption="SD - UHS SDR50 Support Implemented"/>
              <param name="SDR104_SUPPORT" value="0" caption="SD - UHS SDR104 Support Implemented"/>
              <param name="SD_SRC_CLOCK_FREQ" value="0" caption="Source Clock Frequency (MHz)"/>
              <param name="SHARED_BUS" value="0" caption="Shared Bus Enabled"/>
              <param name="SLOT_TYPE" value="0" caption="Slot Usage"/>
              <param name="TIMEOUT_CLK_DIVISION" value="1" caption="Division of TIMEOUT CLOCK compared to &quot;sd_src_clock&quot;"/>
              <param name="TIMEOUT_CLK_FREQ" value="12" caption="TIMEOUT CLOCK frequency"/>
              <param name="TIMEOUT_CLK_FREQ_UNIT" value="1" caption="TIMEOUT CLOCK frequency unit (0=KHz , 1=MHz)"/>
              <param name="TUNING_FOR_SDR50" value="0" caption="SDR50 Tuning Support Enabled"/>
              <param name="USER_DEBOUNCE" value="0" caption="User Debouncing"/>
              <param name="INSTANCE_ID" value="60" caption="Instance index for SDMMC0"/>
              <param name="MCLK_ID_AHB" value="69" caption="Index for SDMMC0 AHB clock"/>
              <param name="MCLK_ID_APB" value="70" caption="Index for SDMMC0 APB clock"/>
              <param name="PAC_ID" value="60" caption="Index for SDMMC0 registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="SERCOM" id="03715" name2="com_sercom_u2201_v6" version="6b0">
          <instance name="SERCOM0">
            <register-group name="SERCOM0" name-in-module="SERCOM" address-space="base" offset="0x46000000"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PC00"/>
              <signal group="PAD" index="1" function="D" pad="PC01"/>
              <signal group="PAD" index="2" function="D" pad="PC02"/>
              <signal group="PAD" index="3" function="D" pad="PC03"/>
            </signals>
            <parameters>
              <param name="CLK_REDUCTION" value="1" caption="Reduce clock options to pin 1 for SPI and USART"/>
              <param name="DMA" value="1" caption="DMA support implemented?"/>
              <param name="DMAC_ID_RX" value="5" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="6" caption="Index of DMA TX trigger"/>
              <param name="FIFO_IMPLEMENTED" value="1" caption="FIFO Rx/Tx implemented?"/>
              <param name="FIFO_SIZE" value="16" caption="Rx-Tx FIFO size in bytes"/>
              <param name="FSYNC_IMPLEMENTED" value="1" caption="SPI Frame Synch mode implemented?"/>
              <param name="GCLK_ID_CORE" value="21"/>
              <param name="GCLK_ID_SLOW" value="18"/>
              <param name="SPI" value="1" caption="SPI mode implemented?"/>
              <param name="TWIM" value="1" caption="TWI Master mode implemented?"/>
              <param name="TWIS" value="1" caption="TWI Slave mode implemented?"/>
              <param name="TWI_HSMODE" value="1" caption="TWI HighSpeed mode implemented?"/>
              <param name="ULTRA_IMPLEMENTATION" value="0" caption="ULTRA platform compatibility?"/>
              <param name="USART" value="1" caption="USART mode implemented?"/>
              <param name="USART_AUTOBAUD" value="1" caption="USART autobaud implemented?"/>
              <param name="USART_IRDA" value="1" caption="USART IrDA implemented?"/>
              <param name="USART_ISO7816" value="1" caption="USART ISO7816 mode implemented?"/>
              <param name="USART_LIN_MASTER" value="1" caption="USART LIN Master mode implemented?"/>
              <param name="USART_RS485" value="1" caption="USART RS485 mode implemented?"/>
              <param name="INSTANCE_ID" value="23" caption="Instance index for SERCOM0"/>
              <param name="MCLK_ID_APB" value="31" caption="Index for SERCOM0 APB clock"/>
              <param name="PAC_ID" value="23" caption="Index for SERCOM0 registers write protection"/>
              <param name="USART_ERROR_INT_SRC" value="55" caption="USART/SPI/I2C Error"/>
              <param name="USART_TX_READY_INT_SRC" value="57" caption="USART-SPI Data Register Empty/ I2C Stop Received"/>
              <param name="USART_TX_COMPLETE_INT_SRC" value="58" caption="USART-SPI Transmit Complete/ I2C Address Match"/>
              <param name="USART_RX_INT_SRC" value="59" caption="USART-SPI Receive Complete/ I2C Data Ready"/>
              <param name="SPI_TX_READY_INT_SRC" value="57" caption="USART-SPI Data Register Empty/ I2C Stop Received"/>
              <param name="SPI_TX_COMPLETE_INT_SRC" value="58" caption="USART-SPI Transmit Complete/ I2C Address Match"/>
              <param name="SPI_RX_INT_SRC" value="59" caption="USART-SPI Receive Complete/ I2C Data Ready"/>
              <param name="I2C_0_INT_SRC" value="55" caption="USART/SPI/I2C Error"/>
              <param name="I2C_1_INT_SRC" value="59" caption="USART-SPI Receive Complete/ I2C Data Ready"/>
              <param name="I2C_2_INT_SRC" value="60" caption="USART Receive Start/ SPI Slave Select Low/ I2C TX FIFO Empty"/>
              <param name="I2C_3_INT_SRC" value="61" caption="USART Clear To Send Input Change/ I2C RX FIFO Full"/>
            </parameters>
          </instance>
          <instance name="SERCOM1">
            <register-group name="SERCOM1" name-in-module="SERCOM" address-space="base" offset="0x46002000"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PC04" ioset="1"/>
              <signal group="PAD" index="0" function="D" pad="PC20" ioset="2"/>
              <signal group="PAD" index="1" function="D" pad="PC05" ioset="1"/>
              <signal group="PAD" index="1" function="D" pad="PC19" ioset="2"/>
              <signal group="PAD" index="2" function="D" pad="PC06" ioset="1"/>
              <signal group="PAD" index="2" function="D" pad="PC18" ioset="2"/>
              <signal group="PAD" index="3" function="D" pad="PC07" ioset="1"/>
              <signal group="PAD" index="3" function="D" pad="PC17" ioset="2"/>
            </signals>
            <parameters>
              <param name="CLK_REDUCTION" value="1" caption="Reduce clock options to pin 1 for SPI and USART"/>
              <param name="DMA" value="1" caption="DMA support implemented?"/>
              <param name="DMAC_ID_RX" value="7" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="8" caption="Index of DMA TX trigger"/>
              <param name="FIFO_IMPLEMENTED" value="1" caption="FIFO Rx/Tx implemented?"/>
              <param name="FIFO_SIZE" value="16" caption="Rx-Tx FIFO size in bytes"/>
              <param name="FSYNC_IMPLEMENTED" value="1" caption="SPI Frame Synch mode implemented?"/>
              <param name="GCLK_ID_CORE" value="22"/>
              <param name="GCLK_ID_SLOW" value="18"/>
              <param name="SPI" value="1" caption="SPI mode implemented?"/>
              <param name="TWIM" value="1" caption="TWI Master mode implemented?"/>
              <param name="TWIS" value="1" caption="TWI Slave mode implemented?"/>
              <param name="TWI_HSMODE" value="1" caption="TWI HighSpeed mode implemented?"/>
              <param name="ULTRA_IMPLEMENTATION" value="0" caption="ULTRA platform compatibility?"/>
              <param name="USART" value="1" caption="USART mode implemented?"/>
              <param name="USART_AUTOBAUD" value="1" caption="USART autobaud implemented?"/>
              <param name="USART_IRDA" value="1" caption="USART IrDA implemented?"/>
              <param name="USART_ISO7816" value="1" caption="USART ISO7816 mode implemented?"/>
              <param name="USART_LIN_MASTER" value="1" caption="USART LIN Master mode implemented?"/>
              <param name="USART_RS485" value="1" caption="USART RS485 mode implemented?"/>
              <param name="INSTANCE_ID" value="24" caption="Instance index for SERCOM1"/>
              <param name="MCLK_ID_APB" value="32" caption="Index for SERCOM1 APB clock"/>
              <param name="PAC_ID" value="24" caption="Index for SERCOM1 registers write protection"/>
              <param name="USART_ERROR_INT_SRC" value="62" caption="USART/SPI/I2C Error"/>
              <param name="USART_TX_READY_INT_SRC" value="64" caption="USART-SPI Data Register Empty/ I2C Stop Received"/>
              <param name="USART_TX_COMPLETE_INT_SRC" value="65" caption="USART-SPI Transmit Complete/ I2C Address Match"/>
              <param name="USART_RX_INT_SRC" value="66" caption="USART-SPI Receive Complete/ I2C Data Ready"/>
              <param name="SPI_TX_READY_INT_SRC" value="64" caption="USART-SPI Data Register Empty/ I2C Stop Received"/>
              <param name="SPI_TX_COMPLETE_INT_SRC" value="65" caption="USART-SPI Transmit Complete/ I2C Address Match"/>
              <param name="SPI_RX_INT_SRC" value="66" caption="USART-SPI Receive Complete/ I2C Data Ready"/>
              <param name="I2C_0_INT_SRC" value="62" caption="USART/SPI/I2C Error"/>
              <param name="I2C_1_INT_SRC" value="66" caption="USART-SPI Receive Complete/ I2C Data Ready"/>
              <param name="I2C_2_INT_SRC" value="67" caption="USART Receive Start/ SPI Slave Select Low/ I2C TX FIFO Empty"/>
              <param name="I2C_3_INT_SRC" value="68" caption="USART Clear To Send Input Change/ I2C RX FIFO Full"/>
            </parameters>
          </instance>
