Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90/atdf/PIC32CZ4010CA90100.atdf
        <register name="EVCTRL" offset="0x4" rw="RW" size="1" initval="0x00" caption="Event Control">
          <bitfield name="DATARDYEO" caption="Data Ready Event Output" mask="0x1"/>
        </register>
        <register name="INTENCLR" offset="0x8" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="DATARDY" caption="Data Ready Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x9" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="DATARDY" caption="Data Ready Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0xA" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="DATARDY" caption="Data Ready Interrupt Flag" mask="0x1"/>
        </register>
        <register name="DATA" offset="0x20" rw="R" size="4" caption="Output Data">
          <bitfield name="DATA" caption="Output Data" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
    </module>
    <module name="USBHS" id="03787" name2="usb_otg_2_0_ctlr_v2" version="2a0" caption="USB High Speed">
      <register-group name="DMACNT" size="0x10">
        <register name="DMACNTL" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="DMA Transfer Control For Each Channel">
          <bitfield name="DMAEN" caption="dma transfer enable" mask="0x1"/>
          <bitfield name="DMADIR" caption="transfer direction" mask="0x2" values="DMACNTL__DMADIR"/>
          <bitfield name="DMAMODE" caption="transfer mode" mask="0x4" values="DMACNTL__DMAMODE"/>
          <bitfield name="DMAIE" caption="interrupt enable" mask="0x8"/>
          <bitfield name="DMAEP" caption="endpoint number this channel is assigned to" mask="0xF0"/>
          <bitfield name="DMAERR" caption="bus error bit" mask="0x100"/>
          <bitfield name="DMABRSTM" caption="burst mode" mask="0x600" values="DMACNTL__DMABRSTM"/>
        </register>
        <register name="DMAADDR" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Memory Address Of The Corresponding DMA Channel">
          <bitfield name="ADDR10" caption="Lower 2 bits of DMA memory address" mask="0x3"/>
          <bitfield name="ADDR312" caption="upper 30 bits of address" mask="0xFFFFFFFC"/>
        </register>
        <register name="DMACOUNT" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Current DMA Count Of The Transfer">
          <bitfield name="DMACOUNT" caption="current dma count of the transfer" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <register-group name="TXFUNADDR" size="0x8">
        <register name="TXFUNCADDREP" offset="0x0" rw="RW" size="1" initval="0x00" caption="Relevant In Host Mode Only. Address Of The Target Function.">
          <bitfield name="TXFUNCADDR" caption="address of the target function" mask="0x7F"/>
        </register>
        <register name="TXHUBADDREP" offset="0x2" rw="RW" size="1" initval="0x00" caption="Relevant In Host Mode Only. HUB Address">
          <bitfield name="TXHUBADDR" caption="hub address" mask="0x7F"/>
          <bitfield name="MULTRANS" caption="hub has multiple or single translator" mask="0x80"/>
        </register>
        <register name="TXHUBPORT" offset="0x3" rw="RW" size="1" initval="0x00" caption="Relevant In Host Mode Only. HUB Address">
          <bitfield name="HUBPORT" caption="Hub Port" mask="0x7F"/>
        </register>
        <register name="RXFUNCADDREP" offset="0x4" rw="RW" size="1" initval="0x00" caption="Relevant In Host Mode Only. Address Of The Target Function.">
          <bitfield name="RXFUNCADDR" caption="address of the target function" mask="0x7F"/>
        </register>
        <register name="RXHUBADDREP" offset="0x6" rw="RW" size="1" initval="0x00" caption="Relevant In Host Mode Only. HUB Address">
          <bitfield name="RXHUBADDR" caption="hub address" mask="0x7F"/>
          <bitfield name="MULTRANS" caption="hub has multiple or single translator" mask="0x80"/>
        </register>
        <register name="RXHUBPORT" offset="0x7" rw="RW" size="1" initval="0x00" caption="Relevant In Host Mode Only. HUB Address">
          <bitfield name="HUBPORT" caption="Hub Port" mask="0x7F"/>
        </register>
      </register-group>
      <register-group name="USBHS" caption="USB High Speed">
        <mode name="ENDPOINTX" qualifier="USBHS.INDEX.SELEP" value="1" caption="Endpont 1-15 are selected. INDEX.SELEP value needs to be greater than 0"/>
        <mode name="ENDPOINT0" qualifier="USBHS.INDEX.SELEP" value="0" caption="Endpont 0 is selected"/>
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="USBHS Control Register A. (All bits except ENABLE and SWRST are Enable protected)">
          <bitfield name="SWRST" caption="USBHS Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="USBHS Enable" mask="0x2"/>
          <bitfield name="IDVAL" caption="Override Valud of ID" mask="0x100"/>
          <bitfield name="IDOVEN" caption="ID Source Select" mask="0x200"/>
          <bitfield name="REFCLKSEL" caption="Select USB PLL Reference Clock  Speed" mask="0x400"/>
        </register>
        <register name="CTRLB" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="USBHS Control Register B">
          <bitfield name="BLANK" caption="Blank the wakeup monitoring for a specific real time" mask="0xFFFFF" values="CTRLB__BLANK"/>
        </register>
        <register name="CTRLC" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="USBHS Control Register C">
          <bitfield name="T1MSEN" caption="REFCLK and SUSPENDM override" mask="0x10"/>
        </register>
        <register name="INTENCLR" offset="0xC" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="USBHS Interrupt Enable Clear Register">
          <bitfield name="WAKEUP" caption="Clear USCORE Detaction Interrupt Enable" mask="0x1"/>
          <bitfield name="RESUME" caption="Clear Resume Interrupt Enable" mask="0x2"/>
          <bitfield name="USB" caption="Clear USBCORE General Interrupt Enable" mask="0x4"/>
          <bitfield name="DMA" caption="Clear DMA Interrupt Enable" mask="0x8"/>
          <bitfield name="T1MS" caption="Clear T1MS Interrupt Enable" mask="0x10"/>
          <bitfield name="PHYRDY" caption="Clear PHYRDY Interrupt Enable" mask="0x20"/>
        </register>
        <register name="INTENSET" offset="0x10" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="USBHS Interrupt Enable Clear Register">
          <bitfield name="WAKEUP" caption="USCORE Detaction Interrupt Enable" mask="0x1"/>
          <bitfield name="RESUME" caption="Resume Interrupt Enable" mask="0x2"/>
          <bitfield name="USB" caption="USBCORE General Interrupt Enable" mask="0x4"/>
          <bitfield name="DMA" caption="DMA Interrupt Enable" mask="0x8"/>
          <bitfield name="T1MS" caption="T1MS Interrupt Enable" mask="0x10"/>
          <bitfield name="PHYRDY" caption="PHYRDY Interrupt Enable" mask="0x20"/>
        </register>
        <register name="INTFLAG" offset="0x14" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="USBHS Interrupt Flag Register">
          <bitfield name="WAKEUP" caption="USB Activity Detection Interrupt" mask="0x1"/>
          <bitfield name="RESUME" caption="Resume Interrupt" mask="0x2"/>
          <bitfield name="USB" caption="USBCORE General Interrupt" mask="0x4"/>
          <bitfield name="DMA" caption="DMA Interrupt" mask="0x8"/>
          <bitfield name="T1MS" caption="Timer 1ms Tick Interrupt" mask="0x10"/>
          <bitfield name="PHYRDY" caption="PHY Ready Interrupt" mask="0x20"/>
        </register>
